Repository: hoshiizumiya/OpenNet
Catalog: OpenNet/Strings/*/Resources.resw
Source language: en_us
Languages: fr, it, ja, ko, ru, zh_cn, zh_hant

# TorrentTrackerListDescription.Text
source: One tracker URL per line. Trackers already present in the magnet or .torrent file and enabled custom trackers are merged automatically.
fr: Un URL de traqueur par ligne. Les traqueurs du lien magnet ou du fichier .torrent sont automatiquement fusionnés avec les traqueurs personnalisés activés.
ja: 1 行に 1 つのトラッカー URL を入力します。マグネットまたは .torrent ファイル内のトラッカーと、有効なカスタムトラッカーは自動的に統合されます。
zh_cn: 每行填写一个 Tracker URL。磁力链接或 .torrent 文件中已有的 Tracker 会与已启用的自定义 Tracker 自动合并。
zh_hant: 每行填寫一個 Tracker URL。磁力連結或 .torrent 檔案中已有的 Tracker 會與已啟用的自訂 Tracker 自動合併。

# TorrentTrackerListFooter.Text
source: The app-wide custom tracker switch and subscriptions are managed in Network settings.
fr: Les traqueurs personnalisés globaux et les abonnements sont gérés dans les paramètres réseau.
ja: アプリ全体のカスタムトラッカーと購読はネットワーク設定で管理します。
zh_cn: 应用范围内的自定义 Tracker 开关和订阅在网络设置中管理。
zh_hant: 全應用程式的自訂 Tracker 開關與訂閱可在網路設定中管理。

# TaskCreateTorrentButton.Text
source: Create torrent...
fr: Créer un torrent...
ja: トレントを作成...
zh_cn: 制作种子...
zh_hant: 製作種子...

# CreateTorrentDialog.PrimaryButtonText
source: Create
fr: Créer
ja: 作成
zh_cn: 创建
zh_hant: 建立

# CreateTorrentDialog.CloseButtonText
source: Cancel
fr: Annuler
ja: キャンセル
zh_cn: 取消
zh_hant: 取消

# CreateTorrentDescription.Text
source: Create a BitTorrent metadata file from a local file or folder.
fr: Crée un fichier de métadonnées BitTorrent à partir d’un fichier ou dossier local.
ja: ローカルのファイルまたはフォルダーから BitTorrent メタデータを作成します。
zh_cn: 从本地文件或文件夹创建 BitTorrent 元数据文件。
zh_hant: 從本機檔案或資料夾建立 BitTorrent 中繼資料檔案。

# CreateTorrentSource.PlaceholderText
source: Source file or folder
fr: Fichier ou dossier source
ja: 元のファイルまたはフォルダー
zh_cn: 源文件或文件夹
zh_hant: 來源檔案或資料夾

# CreateTorrentBrowseFile.Content
source: File...
fr: Fichier...
ja: ファイル...
zh_cn: 文件...
zh_hant: 檔案...

# CreateTorrentBrowseFolder.Content
source: Folder...
fr: Dossier...
ja: フォルダー...
zh_cn: 文件夹...
zh_hant: 資料夾...

# CreateTorrentFormatHybrid.Content
source: Hybrid (v1 + v2)
fr: Hybride (v1 + v2)
ja: ハイブリッド (v1 + v2)
zh_cn: 混合格式（v1 + v2）
zh_hant: 混合格式（v1 + v2）

# CreateTorrentPrivate.Content
source: Private torrent
fr: Torrent privé
ja: プライベート トレント
zh_cn: 私有种子
zh_hant: 私人種子

# CreateTorrentIgnoreDotFiles.Content
source: Ignore hidden dot files
fr: Ignorer les fichiers cachés commençant par un point
ja: 隠しドットファイルを無視
zh_cn: 忽略隐藏的点文件
zh_hant: 忽略隱藏點檔案

# CreateTorrentComment.Header
source: Comment
fr: Commentaire
ja: コメント
zh_cn: 备注
zh_hant: 註解

# CreateTorrentComment.PlaceholderText
source: Optional comment
fr: Commentaire facultatif
ja: 省略可能なコメント
zh_cn: 可选备注
zh_hant: 選填註解

# CreateTorrentTrackers.Header
source: Trackers
fr: Traqueurs
ja: トラッカー
zh_cn: Tracker
zh_hant: Tracker

# CreateTorrentTrackers.PlaceholderText
source: One tracker URL per line
fr: Un URL de traqueur par ligne
ja: 1 行に 1 つのトラッカー URL
zh_cn: 每行一个 Tracker URL
zh_hant: 每行一個 Tracker URL

# CreateTorrentSelectSource
source: Select a source file or folder first.
fr: Sélectionnez d’abord un fichier ou dossier source.
ja: 先に元のファイルまたはフォルダーを選択してください。
zh_cn: 请先选择源文件或文件夹。
zh_hant: 請先選擇來源檔案或資料夾。

# CreateTorrentCreating
source: Hashing files and creating torrent...
fr: Calcul des empreintes et création du torrent...
ja: ファイルをハッシュしてトレントを作成しています...
zh_cn: 正在计算文件哈希并制作种子...
zh_hant: 正在計算檔案雜湊並製作種子...

# CreateTorrentComplete
source: Torrent created successfully.
fr: Le torrent a été créé.
ja: トレントを作成しました。
zh_cn: 种子制作完成。
zh_hant: 種子製作完成。

# CreateTorrentFailed
source: Could not create torrent.
fr: Impossible de créer le torrent.
ja: トレントを作成できませんでした。
zh_cn: 无法制作种子。
zh_hant: 無法製作種子。

# ThemesAppearanceSectionHeader.Text
source: Appearance
fr: Apparence
ja: 外観
zh_cn: 外观
zh_hant: 外觀

# ThemesFontSectionHeader.Text
source: Font
fr: Police
ja: フォント
zh_cn: 字体
zh_hant: 字型

# AboutSectionHeader.Text
source: About
fr: À propos
ja: このアプリについて
zh_cn: 关于
zh_hant: 關於

# AboutVersionLabel.Text
source: Version:
ja: バージョン:
zh_cn: 版本：
zh_hant: 版本：

# AboutWASDKBuildCard.Header
source: Windows App SDK build version
fr: Version de compilation de Windows App SDK
ja: Windows App SDK ビルド バージョン
zh_cn: Windows App SDK 构建版本
zh_hant: Windows App SDK 建置版本

# AboutWASDKRuntimeCard.Header
source: Windows App SDK runtime version
fr: Version d’exécution de Windows App SDK
ja: Windows App SDK ランタイム バージョン
zh_cn: Windows App SDK 运行时版本
zh_hant: Windows App SDK 執行階段版本

# AboutWinUIEssentialBuildCard.Header
source: WinUI Essentials build SDK version
fr: Version du SDK WinUI Essentials
ja: WinUI Essentials ビルド SDK バージョン
zh_cn: WinUI Essentials 构建 SDK 版本
zh_hant: WinUI Essentials 建置 SDK 版本

# AboutDependenciesHeader.Text
source: Dependencies & references
fr: Dépendances et références
ja: 依存関係と参照
zh_cn: 依赖项与参考项目
zh_hant: 相依性與參考專案

# AboutWarrantyText.Text
source: THIS CODE AND INFORMATION IS PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED.
fr: CE CODE ET CES INFORMATIONS SONT FOURNIS EN L’ÉTAT, SANS GARANTIE EXPRESSE OU IMPLICITE.
ja: このコードと情報は、明示または黙示を問わず、いかなる保証もなく現状のまま提供されます。
zh_cn: 本代码和信息按“原样”提供，不作任何明示或默示担保。
zh_hant: 本程式碼與資訊依「現狀」提供，不附任何明示或默示保證。

# AboutLicenseSourceLink.Content
source: License & source
fr: Licence et code source
ja: ライセンスとソース
zh_cn: 许可证与源代码
zh_hant: 授權與原始碼

# AboutProductionRole.Text
source: Production / Visual Design
fr: Production / conception visuelle
ja: 制作 / ビジュアルデザイン
zh_cn: 制作 / 视觉设计
zh_hant: 製作 / 視覺設計

# AboutProgrammingRole.Text
source: Programming Director
fr: Direction de la programmation
ja: プログラミングディレクター
zh_cn: 程序开发负责人
zh_hant: 程式開發負責人

# AboutAIAssistantRole.Text
source: AI Programming Assistant / Consultant
fr: Assistant de programmation IA / consultant
ja: AI プログラミングアシスタント / コンサルタント
zh_cn: AI 编程助手 / 顾问
zh_hant: AI 程式設計助理 / 顧問

# AboutFrameworkRole.Text
source: Software Framework
fr: Infrastructure logicielle
ja: ソフトウェア フレームワーク
zh_cn: 软件框架
zh_hant: 軟體框架

# AboutSpecialThanksRole.Text
source: Special Thanks
fr: Remerciements particuliers
ja: スペシャルサンクス
zh_cn: 特别鸣谢
zh_hant: 特別感謝

# AboutYouText.Text
source: You!
fr: Vous !
ja: あなた！
zh_cn: 你！
zh_hant: 你！

# AboutHelpFeedbackLink.Content
source: Help & feedback
fr: Aide et commentaires
ja: ヘルプとフィードバック
zh_cn: 帮助与反馈
zh_hant: 說明與意見反應

# AboutOpenSourceExpander.Header
source: OpenNet open source
ja: OpenNet オープンソース
zh_cn: OpenNet 开源项目
zh_hant: OpenNet 開放原始碼

# AboutOpenSourceExpander.Description
source: OpenNet for WinUI 3
fr: OpenNet pour WinUI 3
ja: WinUI 3 向け OpenNet
zh_cn: 基于 WinUI 3 的 OpenNet
zh_hant: 基於 WinUI 3 的 OpenNet

# AboutJoinProjectLink.Content
source: Join the project on GitHub
fr: Participer au projet sur GitHub
ja: GitHub でプロジェクトに参加
zh_cn: 在 GitHub 上参与项目
zh_hant: 在 GitHub 參與專案

# AboutGoToRepoText.Text
source: Go to the repository
fr: Accéder au dépôt
ja: リポジトリへ移動
zh_cn: 前往代码仓库
zh_hant: 前往程式碼存放庫

# AboutLastCommitLabel.Text
source: Last commit:
fr: Dernier commit :
ja: 最終コミット:
zh_cn: 最后提交：
zh_hant: 最後提交：

# ViewTaskTrackersPageEditTrackersDialog.Title
source: Edit trackers
fr: Modifier traqueurs
ja: トラッカーを編集
zh_cn: 编辑 Tracker
zh_hant: 編輯 Tracker

# ViewTaskTrackersPageEditTrackersDialog.PrimaryButtonText
source: Save
fr: Enregistrer
ja: 保存
zh_cn: 保存
zh_hant: 儲存

# ViewTaskTrackersPageEditTrackersDialog.CloseButtonText
source: Cancel
fr: Annuler
ja: キャンセル
zh_cn: 取消
zh_hant: 取消

# ViewTaskTrackersPageTrackerEditorTextBox.PlaceholderText
source: One HTTP, HTTPS or UDP tracker URL per line
fr: Une URL de traqueur HTTP, HTTPS ou UDP par ligne
ja: 1 行につき 1 つの HTTP、HTTPS、または UDP トラッカー URL
zh_cn: 每行输入一个 HTTP、HTTPS 或 UDP Tracker URL
zh_hant: 每行輸入一個 HTTP、HTTPS 或 UDP Tracker URL

# ViewTaskTrackersPageRemoveTrackerDialog.Title
source: Remove tracker?
fr: Supprimer traqueur?
ja: トラッカーを削除しますか？
zh_cn: 删除 Tracker？
zh_hant: 要移除 Tracker 嗎？

# ViewTaskTrackersPageRemoveTrackerDialog.PrimaryButtonText
source: Remove
fr: Supprimer
ja: 削除
zh_cn: 删除
zh_hant: 移除

# ViewTaskTrackersPageRemoveTrackerDialog.CloseButtonText
source: Cancel
fr: Annuler
ja: キャンセル
zh_cn: 取消
zh_hant: 取消

# ViewTaskTrackersPageClearAllTrackerLogsDialog.Title
source: Clear all tracker logs?
fr: Effacer tous traqueur journaux?
ja: すべてのトラッカーログを消去しますか？
zh_cn: 清除所有 Tracker 日志？
zh_hant: 要清除所有 Tracker 記錄嗎？

# ViewTaskTrackersPageClearAllTrackerLogsDialog.PrimaryButtonText
source: Clear all
fr: Effacer tous
ja: すべて消去
zh_cn: 全部清除
zh_hant: 全部清除

# ViewTaskTrackersPageClearAllTrackerLogsDialog.CloseButtonText
source: Cancel
fr: Annuler
ja: キャンセル
zh_cn: 取消
zh_hant: 取消

# ViewTaskTrackersPageClearAllTrackerLogsMessage.Text
source: This clears in-memory tracker logs for every task.
fr: Cette action efface les journaux de tracker en mémoire pour toutes les tâches.
ja: すべてのタスクのメモリ内トラッカーログを消去します。
zh_cn: 这将清除所有任务的内存中 Tracker 日志。
zh_hant: 這將清除所有工作的記憶體內 Tracker 記錄。

# ViewTaskTrackersPageRemoveUnreachableTrackersDialog.Title
source: Remove unreachable trackers
fr: Supprimer unreachable traqueurs
ja: 到達不能なトラッカーを削除
zh_cn: 删除无法访问的 Tracker
zh_hant: 移除無法連線的 Tracker

# ViewTaskTrackersPageRemoveUnreachableTrackersDialog.PrimaryButtonText
source: Remove
fr: Supprimer
ja: 削除
zh_cn: 删除
zh_hant: 移除

# ViewTaskTrackersPageRemoveUnreachableTrackersDialog.CloseButtonText
source: Cancel
fr: Annuler
ja: キャンセル
zh_cn: 取消
zh_hant: 取消

# ViewTaskTrackersPageRemoveUnreachablePromptText.Text
source: Remove all trackers that have reached the number of retries:
fr: Supprimer tous les traqueurs ayant atteint le nombre de tentatives suivant :
ja: 再試行回数が次の値に達したすべてのトラッカーを削除:
zh_cn: 删除已达到重试次数上限的所有 Tracker：
zh_hant: 移除所有已達到以下重試次數的 Tracker：

# ViewTaskTrackersPageMessageDialog.CloseButtonText
source: Close
fr: Fermer
ja: 閉じる
zh_cn: 关闭
zh_hant: 關閉

# DL_BrowseSavePath.Content
source: Browse...
fr: Parcourir...
ja: 参照...
zh_cn: 浏览...
zh_hant: 瀏覽...

# DL_BrowseMovePath.Content
source: Browse...
fr: Parcourir...
ja: 参照...
zh_cn: 浏览...
zh_hant: 瀏覽...

# DL_Aria2Connections.Header
source: HTTP download connections
fr: Connexions de téléchargement HTTP
ja: HTTP ダウンロード接続数
zh_cn: HTTP 下载连接数
zh_hant: HTTP 下載連線數

# DL_Aria2Connections.Description
source: Connections used for each HTTP download
fr: Nombre de connexions utilisées pour chaque téléchargement HTTP
ja: 各 HTTP ダウンロードで使用する接続数
zh_cn: 每个 HTTP 下载任务使用的连接数
zh_hant: 每個 HTTP 下載工作使用的連線數

# RestartLanguageInfoBar.Title
source: Restart OpenNet to apply the language change
fr: Redémarrez OpenNet pour appliquer la langue
ja: 言語を適用するには OpenNet を再起動してください
zh_cn: 重启 OpenNet 以应用语言更改
zh_hant: 重新啟動 OpenNet 以套用語言變更

# ViewThemeSettingFallbackColorCard.Title
source: Fallback color when the window loses focus
fr: Couleur de repli lorsque la fenêtre perd le focus
ja: ウィンドウが非アクティブなときの代替色
zh_cn: 窗口失去焦点时的回退颜色
zh_hant: 視窗失去焦點時的後備色彩

# ViewThemeSettingTintColorCard.Title
source: Tint color
fr: Couleur de teinte
ja: 色合い
zh_cn: 色调颜色
zh_hant: 色調色彩

# WebUISettingsFollowLanguageCard.Header
source: Follow application language
fr: Suivre la langue de l'application
ja: アプリの言語に合わせる
zh_cn: 跟随应用语言
zh_hant: 跟隨應用程式語言

# WebUISettingsFollowLanguageCard.Description
source: Keep the Web UI locale synchronized with OpenNet's application language.
fr: Synchroniser la langue de l'interface Web avec celle d'OpenNet.
ja: Web UI の言語を OpenNet のアプリ言語と同期します。
zh_cn: 使 Web UI 语言与 OpenNet 的应用语言保持同步。
zh_hant: 讓 Web UI 語言與 OpenNet 的應用程式語言保持同步。

# CF_EditPatternLabel.Text
source: Client pattern
fr: Modèle de client
ja: クライアント パターン
zh_cn: 客户端模式
zh_hant: 用戶端模式

# CF_EditMatchTypeLabel.Text
source: Match type
fr: Type de correspondance
ja: 一致の種類
zh_cn: 匹配类型
zh_hant: 比對類型

# CF_EditMatchContains.Content
source: Contains
fr: Contient
ja: 含む
zh_cn: 包含
zh_hant: 包含

# CF_EditMatchExact.Content
source: Exact
ja: 完全一致
zh_cn: 完全匹配
zh_hant: 完全比對

# CF_EditMatchWildcard.Content
source: Wildcard
fr: Caractères génériques
ja: ワイルドカード
zh_cn: 通配符
zh_hant: 萬用字元

# CF_EditMatchRegex.Content
source: Regular expression
fr: Expression régulière
ja: 正規表現
zh_cn: 正则表达式
zh_hant: 規則運算式

# CF_EditCaseSensitive.Header
source: Case sensitive
fr: Respecter la casse
ja: 大文字と小文字を区別
zh_cn: 区分大小写
zh_hant: 區分大小寫

# CF_EditEnabled.Header
source: Enabled
fr: Activé
ja: 有効
zh_cn: 已启用
zh_hant: 已啟用

# CF_EditDescriptionLabel.Text
source: Description
ja: 説明
zh_cn: 描述
zh_hant: 描述

# CF_ImportHint.Text
source: JSON preserves every rule option. Plain text imports one case-insensitive Contains rule per line.
fr: JSON conserve toutes les options de règle. Le texte brut importe une règle Contient insensible à la casse par ligne.
ja: JSON はすべてのルール オプションを保持します。プレーン テキストは、1 行につき大文字と小文字を区別しない「含む」ルールとして取り込みます。
zh_cn: JSON 会保留每个规则选项。纯文本将每行导入为一条不区分大小写的“包含”规则。
zh_hant: JSON 會保留每個規則選項。純文字將每行匯入為一條不區分大小寫的「包含」規則。

# CF_ReplaceExisting.Content
source: Replace all existing rules before importing
fr: Remplacer toutes les règles avant l’importation
ja: 取り込み前に既存のルールをすべて置換
zh_cn: 导入前替换全部现有规则
zh_hant: 匯入前取代全部現有規則

# CF_ClearRulesMessage.Text
source: Remove every client filter rule? This cannot be undone.
fr: Supprimer toutes les règles de filtrage des clients ? Cette action est irréversible.
ja: すべてのクライアント フィルター ルールを削除しますか。この操作は元に戻せません。
zh_cn: 移除所有客户端过滤规则？此操作无法撤销。
zh_hant: 移除所有用戶端篩選規則？此操作無法復原。

# CF_DeleteRulePrompt
source: Delete this rule?
fr: Supprimer cette règle ?
ja: このルールを削除しますか。
zh_cn: 删除此规则？
zh_hant: 刪除此規則？

# IPF_EditSubscriptionEnabled.Content
source: Enable this source
fr: Activer cette source
ja: このソースを有効にする
zh_cn: 启用此来源
zh_hant: 啟用此來源

# IPF_EditRuleEntryLabel.Text
source: IP address, CIDR block, or range
fr: Adresse IP, bloc CIDR ou plage
ja: IP アドレス、CIDR ブロック、または範囲
zh_cn: IP 地址、CIDR 块或范围
zh_hant: IP 位址、CIDR 區塊或範圍

# IPF_EditRuleDescriptionLabel.Text
source: Description (optional)
fr: Description (facultative)
ja: 説明 (省略可能)
zh_cn: 描述（可选）
zh_hant: 描述（選填）

# IPF_DeleteRulePrompt
source: Delete this rule?
fr: Supprimer cette règle ?
ja: このルールを削除しますか。
zh_cn: 删除此规则？
zh_hant: 刪除此規則？

# IPF_ClearAllRulesDialogMessage.Text
source: Are you sure you want to remove all IP filter rules? This action cannot be undone.
fr: Voulez-vous vraiment supprimer toutes les règles du filtre IP ? Cette action est irréversible.
ja: すべての IP フィルタールールを削除してもよろしいですか？この操作は元に戻せません。
zh_cn: 确定要删除所有 IP 过滤规则吗？此操作无法撤销。
zh_hant: 確定要移除所有 IP 篩選規則嗎？此操作無法復原。

# BT_QueueingEnabled.Header
source: Enable torrent queueing
fr: Activer la file d’attente des torrents
ja: Torrent キューを有効にする
zh_cn: 启用 Torrent 队列
zh_hant: 啟用 Torrent 佇列

# BT_QueueingEnabled.Description
source: Limit the number of simultaneously active downloads, uploads, and torrents. Turn this off for unlimited scheduling.
fr: Limite le nombre de téléchargements, envois et torrents actifs simultanément. Désactivez cette option pour une planification illimitée.
ja: 同時にアクティブになるダウンロード、アップロード、Torrent の数を制限します。無制限にするにはオフにします。
zh_cn: 限制同时活动的下载、做种和 Torrent 数量。关闭后不限制任务调度数量。
zh_hant: 限制同時活動的下載、做種和 Torrent 數量。關閉後不限制工作排程數量。

# BT_MixedModePreferTcp.Content
source: Prefer TCP
fr: Préférer TCP
ja: TCP を優先
zh_cn: 优先 TCP
zh_hant: 優先 TCP

# BT_MixedModePeerProportional.Content
source: Peer proportional
fr: Proportionnel aux pairs
ja: ピア比率
zh_cn: 按节点比例分配
zh_hant: 按節點比例分配

# BT_UploadSlotsFixed.Content
source: Fixed slots
fr: Créneaux fixes
ja: 固定スロット
zh_cn: 固定槽位
zh_hant: 固定槽位

# BT_UploadSlotsRateBased.Content
source: Upload rate based
fr: Basé sur le débit montant
ja: アップロード速度ベース
zh_cn: 基于上传速率
zh_hant: 依上傳速率

# BT_UploadChokingRoundRobin.Content
source: Round-robin
fr: Tourniquet
ja: ラウンドロビン
zh_cn: 轮询
zh_hant: 輪詢

# BT_UploadChokingFastest.Content
source: Fastest upload
fr: Envoi le plus rapide
ja: 最速アップロード
zh_cn: 最快上传
zh_hant: 最快上傳

# BT_UploadChokingAntiLeech.Content
source: Anti-leech
ja: アンチリーチ
zh_cn: 反吸血
zh_hant: 反吸血

# BT_ApplyIpFilterToDht.Header
source: Apply IP filter to DHT
zh_cn: 将 IP 过滤器应用到 DHT
zh_hant: 將 IP 篩選器套用至 DHT

# BT_ApplyIpFilterToDht.Description
source: Reject filtered addresses in DHT traffic and routing entries.
zh_cn: 拒绝 DHT 流量和路由表中被过滤的地址。
zh_hant: 拒絕 DHT 流量和路由項目中已篩選的位址。

# BT_WebTorrent.Description
source: Enable WebRTC peers announced by WebSocket trackers.
zh_cn: 启用由 WebSocket Tracker 通告的 WebRTC 节点。
zh_hant: 啟用由 WebSocket Tracker 公告的 WebRTC 節點。

# BT_WebTorrentStunServer.Header
source: WebTorrent STUN server
zh_cn: WebTorrent STUN 服务器
zh_hant: WebTorrent STUN 伺服器

# BT_WebTorrentStunServer.Description
source: STUN endpoint in hostname:port format used for ICE traversal.
zh_cn: 用于 ICE 穿透的 hostname:port 格式 STUN 端点。
zh_hant: 用於 ICE 穿透的 hostname:port 格式 STUN 端點。

# BT_WebTorrentOffers.Header
source: Maximum WebTorrent offers
zh_cn: WebTorrent 提议上限
zh_hant: WebTorrent 提議上限

# BT_WebTorrentOffers.Description
source: Maximum WebRTC offers per tracker announce and concurrent negotiations.
zh_cn: 每次 Tracker 通告的 WebRTC 提议及并发协商上限。
zh_hant: 每次 Tracker 公告的 WebRTC 提議與並行協商上限。

# BT_WebTorrentTimeout.Header
source: WebTorrent connection timeout
zh_cn: WebTorrent 连接超时
zh_hant: WebTorrent 連線逾時

# BT_WebTorrentTimeout.Description
source: Time in seconds to wait for a WebRTC connection.
zh_cn: 等待 WebRTC 连接的秒数。
zh_hant: 等待 WebRTC 連線的秒數。

# BT_WebSocketAnnounceInterval.Header
source: Minimum WebSocket announce interval
zh_cn: WebSocket 最短通告间隔
zh_hant: WebSocket 最短公告間隔

# BT_WebSocketAnnounceInterval.Description
source: Minimum accepted WebSocket tracker announce interval in seconds.
zh_cn: 可接受的 WebSocket Tracker 最短通告间隔（秒）。
zh_hant: 可接受的 WebSocket Tracker 最短公告間隔（秒）。

# BT_DisableV1HashesForHybrid.Header
source: Skip v1 hashes for hybrid torrents
zh_cn: 混合种子跳过 v1 哈希
zh_hant: 混合種子略過 v1 雜湊

# BT_DisableV1HashesForHybrid.Description
source: Validate hybrid torrents with v2 SHA-256 hashes only to reduce disk I/O and CPU use.
zh_cn: 混合种子仅验证 v2 SHA-256 哈希，以减少磁盘 I/O 和 CPU 占用。
zh_hant: 混合種子僅驗證 v2 SHA-256 雜湊，以降低磁碟 I/O 與 CPU 使用量。

# BT_PartFileDirectory.Header
source: Part-file directory
zh_cn: Part-file 目录
zh_hant: Part-file 目錄

# BT_PartFileDirectory.Description
source: Optional relative subdirectory for partial data belonging to skipped files.
zh_cn: 用于保存已跳过文件所对应部分数据的可选相对子目录。
zh_hant: 用於儲存已略過檔案所對應部分資料的選用相對子目錄。

# BT_MaxTorrentDirectoryDepth.Header
source: Maximum torrent directory depth
zh_cn: 种子目录最大深度
zh_hant: 種子目錄最大深度

# BT_MaxTorrentDirectoryDepth.Description
source: Reject torrent metadata whose file tree exceeds this nesting depth.
zh_cn: 拒绝文件树嵌套深度超过此值的种子元数据。
zh_hant: 拒絕檔案樹巢狀深度超過此值的種子中繼資料。

# BT_NatPmpGateway.Header
source: NAT-PMP gateway
zh_cn: NAT-PMP 网关
zh_hant: NAT-PMP 閘道

# BT_NatPmpLeaseDuration.Header
source: NAT-PMP lease duration (seconds)
zh_cn: NAT-PMP 租约时长（秒）
zh_hant: NAT-PMP 租約時間（秒）

# BT_ProxySendHostInConnect.Header
source: Send host name in HTTP CONNECT
zh_cn: 在 HTTP CONNECT 中发送主机名
zh_hant: 在 HTTP CONNECT 中傳送主機名稱

# BT_I2pHostname.Header
source: I2P SAM host
zh_cn: I2P SAM 主机
zh_hant: I2P SAM 主機

# BT_I2pPort.Header
source: I2P SAM port
zh_cn: I2P SAM 端口
zh_hant: I2P SAM 連接埠

# BT_I2pMixedMode.Header
source: Allow mixed I2P and Internet peers
zh_cn: 允许混合 I2P 与互联网节点
zh_hant: 允許混合 I2P 與網際網路節點

# BT_I2pInboundQuantity.Header
source: I2P inbound tunnel quantity
zh_cn: I2P 入站隧道数量
zh_hant: I2P 輸入通道數量

# BT_I2pOutboundQuantity.Header
source: I2P outbound tunnel quantity
zh_cn: I2P 出站隧道数量
zh_hant: I2P 輸出通道數量

# BT_I2pInboundLength.Header
source: I2P inbound tunnel length
zh_cn: I2P 入站隧道长度
zh_hant: I2P 輸入通道長度

# BT_I2pOutboundLength.Header
source: I2P outbound tunnel length
zh_cn: I2P 出站隧道长度
zh_hant: I2P 輸出通道長度

# BT_I2pInboundVariance.Header
source: I2P inbound length variance
zh_cn: I2P 入站长度变化量
zh_hant: I2P 輸入長度變異

# BT_I2pOutboundVariance.Header
source: I2P outbound length variance
zh_cn: I2P 出站长度变化量
zh_hant: I2P 輸出長度變異

# BT_I2p.Description
source: Enable I2P torrents through a SAM bridge; I2P PEX is handled by libtorrent 2.1.
zh_cn: 通过 SAM 网桥启用 I2P 种子；I2P PEX 由 libtorrent 2.1 处理。
zh_hant: 透過 SAM 橋接器啟用 I2P 種子；I2P PEX 由 libtorrent 2.1 處理。

# TorrentTaskLimitsSection.Text
source: Task limits
zh_cn: 任务限制
zh_hant: 工作限制

# TorrentTaskDownloadLimit.Header
source: Maximum download rate (KiB/s)
zh_cn: 最大下载速率（KiB/s）
zh_hant: 最大下載速率（KiB/s）

# TorrentTaskUploadLimit.Header
source: Maximum upload rate (KiB/s)
zh_cn: 最大上传速率（KiB/s）
zh_hant: 最大上傳速率（KiB/s）

# TorrentTaskMinimumUploadRate.Header
source: Preferred minimum upload rate (KiB/s)
zh_cn: 首选最小上传速率（KiB/s）
zh_hant: 偏好的最小上傳速率（KiB/s）

# TorrentTaskMinimumUploadRateInfo.Title
source: Minimum rate target
zh_cn: 最小速率目标
zh_hant: 最小速率目標

# TorrentTaskMinimumUploadRateInfo.Message
source: libtorrent has no hard minimum-rate guarantee. OpenNet stores this target and shows it in the task row; the engine still depends on peer demand and global limits.
zh_cn: libtorrent 不提供硬性的最小速率保证。OpenNet 会保存该目标并显示在任务行中；实际速率仍取决于节点需求和全局限制。
zh_hant: libtorrent 不提供硬性的最小速率保證。OpenNet 會儲存此目標並顯示於工作列；實際速率仍取決於節點需求與全域限制。

# TorrentTaskMaxConnections.Header
source: Maximum connections
zh_cn: 最大连接数
zh_hant: 最大連線數

# TorrentTaskMaxUploads.Header
source: Maximum upload slots
zh_cn: 最大上传槽位
zh_hant: 最大上傳插槽

# TorrentTaskDiscoverySection.Text
source: Peer discovery and behavior
zh_cn: 节点发现与任务行为
zh_hant: 節點探索與工作行為

# TorrentTaskEnableDht.Header
source: Use DHT for this task
zh_cn: 为此任务使用 DHT
zh_hant: 此工作使用 DHT

# TorrentTaskEnableLsd.Header
source: Use local peer discovery for this task
zh_cn: 为此任务使用本地节点发现
zh_hant: 此工作使用本機節點探索

# TorrentTaskEnablePex.Header
source: Use peer exchange for this task
zh_cn: 为此任务使用节点交换
zh_hant: 此工作使用節點交換

# TorrentTaskApplyIpFilter.Header
source: Apply IP filter
zh_cn: 应用 IP 过滤器
zh_hant: 套用 IP 篩選器

# TorrentTaskSequentialDownload.Header
source: Sequential download
zh_cn: 顺序下载
zh_hant: 循序下載

# TorrentTaskSuperSeeding.Header
source: Super seeding
zh_cn: 超级做种
zh_hant: 超級做種

# TorrentTaskForceStart.Header
source: Force start and bypass queue
zh_cn: 强制启动并绕过队列
zh_hant: 強制啟動並略過佇列

# TorrentTaskUploadMode.Header
source: Upload-only mode
zh_cn: 仅上传模式
zh_hant: 僅上傳模式

# TorrentTaskShareMode.Header
source: Share mode
zh_cn: 分享模式
zh_hant: 分享模式

# TorrentTaskSettingsStatus.Title
source: Task settings
zh_cn: 任务设置
zh_hant: 工作設定

# TorrentTaskApplySettingsButton.Content
source: Apply
zh_cn: 应用
zh_hant: 套用

# TorrentTaskSettingsApplied
source: Task settings applied.
zh_cn: 任务设置已应用。
zh_hant: 已套用工作設定。

# TorrentTaskSettingsApplyFailed
source: Task settings could not be applied.
zh_cn: 无法应用任务设置。
zh_hant: 無法套用工作設定。

# TorrentTaskSettingsInvalidLimits
source: The rate values are invalid, or the minimum upload target is greater than the maximum upload limit.
zh_cn: 速率值无效，或最小上传目标高于最大上传限制。
zh_hant: 速率值無效，或最小上傳目標高於最大上傳限制。

# BT_UnchokeSlotsLimit.Header
source: Global upload slots
zh_cn: 全局上传槽位
zh_hant: 全域上傳插槽

# BT_UnchokeSlotsLimit.Description
source: Maximum peers unchoked globally; -1 is unlimited.
zh_cn: 全局同时解除阻塞的节点上限；-1 表示无限制。
zh_hant: 全域同時解除阻擋的節點上限；-1 表示無限制。

# BT_AlertQueueSize.Header
source: Alert queue capacity
zh_cn: 警报队列容量
zh_hant: 警示佇列容量

# BT_AlertQueueSize.Description
source: Maximum pending libtorrent alerts before low-priority alerts may be dropped.
zh_cn: libtorrent 丢弃低优先级警报前允许积压的最大警报数。
zh_hant: libtorrent 捨棄低優先級警示前允許累積的最大警示數。

# BT_Section_Tracker.Text
source: Tracker
fr: Traqueur
ja: トラッカー
ko: 트래커
ru: Трекер
zh_cn: 追踪器

# BT_Section_Proxy.Text
source: Proxy
ja: プロキシ
ko: 프록시
ru: Прокси
zh_cn: 代理

# RuntimeStatusWindow.Title
source: OpenNet Runtime Status
fr: OpenNet Runtime État
it: Stato runtime di OpenNet
ja: OpenNet ランタイム状態
ko: OpenNet 런타임 상태
ru: Состояние OpenNet во время выполнения
zh_cn: OpenNet 运行状态

# RuntimeStatusTitleBar.Title
source: OpenNet Runtime Status
fr: OpenNet Runtime État
it: Stato runtime di OpenNet
ja: OpenNet ランタイム状態
ko: OpenNet 런타임 상태
ru: Состояние OpenNet во время выполнения
zh_cn: OpenNet 运行状态

# RuntimeStatusRefreshButton.Label
source: Refresh
fr: Actualiser
it: Aggiorna
ja: 更新
ko: 새로 고침
ru: Обновить
zh_cn: 刷新

# RuntimeStatusCopyButton.Label
source: Copy all
fr: Copier tous
it: Copia tutto
ja: すべてコピー
ko: 모두 복사
ru: Копировать все
zh_cn: 复制全部

# RuntimeStatusItemColumn.Text
source: Status item
fr: État item
it: Voce di stato
ja: 状態項目
ko: 상태 항목
ru: Элемент состояния
zh_cn: 状态项目
